{
  "backend/main.mo": "Defines the main actor with user profiles, cards, custom categories, transactions, and access control, providing storage and user-facing CRUD/query methods.",
  "backend/migration.mo": "Implements migration logic converting an outdated actor state into the new upgraded structure for user profiles and data.",
  "feature_evidence.json": "Lists feature evidence entries mapping product features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all major frontend files describing their components, pages, hooks, and UI state modules.",
  "frontend/index.css": "Defines global Tailwind-based styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React layout and routing setup using TanStack Router with navigation, theming, and page mounting.",
  "frontend/src/components/cards/CardFormDialog.tsx": "Modal form for creating or editing a card, handling name, color selection, and CSV mapping defaults with mutation submission.",
  "frontend/src/components/cards/CardListItem.tsx": "Displays a card entry with upload status, edit button, and an upload statement action.",
  "frontend/src/components/cards/StatementUploadButton.tsx": "Handles CSV file selection, parses transactions, triggers processing, and manages upload errors and mapping validation.",
  "frontend/src/components/settings/CategoryMappingsEditor.tsx": "UI for mapping card-provided categories to custom categories, allowing creation of new mappings.",
  "frontend/src/components/settings/CsvMappingEditor.tsx": "Editor for configuring per-card CSV column indexes and saving updated mappings.",
  "frontend/src/components/settings/CustomCategoriesManager.tsx": "Manages creation of custom categories and toggling their need/want type.",
  "frontend/src/components/transactions/TransactionsExport.tsx": "Generates export text for transactions and provides a copy-to-clipboard interface.",
  "frontend/src/components/transactions/TransactionsTable.tsx": "Renders a table of transactions with category and need/want resolution, applying overrides and user-editable selections.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity state management using AuthClient and React context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for cards, categories, transactions, and related mutations using the backend actor.",
  "frontend/src/index.css": "Configures Tailwind CSS with light/dark theme variables and base styles.",
  "frontend/src/lib/csvImport.ts": "Parses CSV data into transactions based on a card’s column mapping and category mappings.",
  "frontend/src/lib/transactionsExport.ts": "Formats transactions into a tab‑delimited export string, applying category and need/want overrides.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/CardsManagerPage.tsx": "Displays and manages credit card accounts, supports adding/editing cards, uploading statements, and resetting all transactions.",
  "frontend/src/pages/SettingsPage.tsx": "Provides tabs to manage custom categories, category mappings, and per-card CSV column mappings.",
  "frontend/src/pages/TransactionsPage.tsx": "Shows imported transactions with loading/empty states and provides a table plus export functionality.",
  "frontend/src/state/transactionCategoryOverrides.ts": "Zustand store for per-transaction custom category overrides keyed by a deterministic transaction ID.",
  "frontend/src/state/transactionNeedWantOverrides.ts": "Zustand store for per-transaction need/want overrides, removing entries when set to auto.",
  "frontend/src/state/uploadStatus.ts": "Zustand store tracking which cards have uploaded statements and providing helpers to mark or clear uploads.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters and session-stored parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions, plugins, and styling tokens.",
  "project_state.json": "Project metadata describing app purpose, architecture notes, requirements, and implemented features."
}